import tkinter as tk
from tkinter import Tk, RIGHT, BOTH, RAISED
from tkinter.ttk import Frame, Button, Style


win = tk.Tk()
win.title("Auto create letter outlook (ACLO)")#Название программы
win.geometry("500x400+100+200")#Размер окна
win.resizable(False, False)#Нельзя растягивать
photo = tk.PhotoImage(file="icon.png")#Инициализация иконки программы
win.iconphoto(False, photo)#Загрузка иконки в программу
win.config(bg='#E1FEFF')#Фон
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#Текст 1
label_1 = tk.Label(win, text='ACLO автоматически формирует письмо перед отправкой\nПодставляет адрес, тему, текст и данные из БД\n"Недоступность каналов связи"',
            bg="#E1FEFF",
            font=("Areal",10,),
            height=5
)
label_1.pack()#Метод который размещает текст

#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#Ввод данных и текст
 
label_3 = tk.Label(text="Номер канала, например 053",
            height=3,
            anchor='sw',
            
)
label_3.pack()

entry = tk.Entry(width="3")
entry.pack()

#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
#Кнопка 
btn1 = tk.Button(win,text="формировать")
btn1.pack()#Метод который размещает кнопку

#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Текст для примечания 
label_2 = tk.Label(win, text='1. Должен быть установлен MS Outlook\n2. Файл .db должен находиться в одной директории с aclo.exe',
            bg="#E1FEFF",
            font=("Areal",10,),
            width=80,
            anchor='sw',
            justify=tk.LEFT
)
label_2.pack()#Метод который размещает примичание
#-------------------------------------------------------------------------------------------------------------------------------------------------------------------------



win.mainloop()


